{"articles": [
    {
        "keyword": "Image segmentation",
        "filename": "Image Segmentation Using Deep Learning A Survey",
        "description": "Image segmentation is a key topic in image processing and computer vision with applications such as scene understanding, medical image analysis, robotic perception, video surveillance, augmented reality, and image compression, among many others. Various algorithms for image segmentation have been developed in the literature. Recently, due to the success of deep learning models in a wide range of vision applications, there has been a substantial amount of works aimed at developing image segmentation approaches using deep learning models. In this survey, we provide a comprehensive review of the literature at the time of this writing, covering a broad spectrum of pioneering works for semantic and instance-level segmentation, including fully convolutional pixel-labeling networks, encoder-decoder architectures, multi-scale and pyramid based approaches, recurrent networks, visual attention models, and generative models in adversarial settings. We investigate the similarity, strengths and challenges of these deep learning models, examine the most widely used datasets, report performances, and discuss promising future research directions in this area.",
        "path": "/files/Image Segmentation Using Deep Learning A Survey.pdf"
    },

    {
        "keyword": "Image segmentation",
        "filename": "K-Net Towards Unified Image Segmentation",
        "description": "Semantic, instance, and panoptic segmentations have been addressed using different and specialized frameworks despite their underlying connections. This paper presents a unified, simple, and effective framework for these essentially similar tasks. The framework, named K-Net, segments both instances and semantic categories consistently by a group of learnable kernels, where each kernel is responsible for generating a mask for either a potential instance or a stuff class. To remedy the difficulties of distinguishing various instances, we propose a kernel update strategy that enables each kernel dynamic and conditional on its meaningful group in the input image. K-Net can be trained in an end-to-end manner with bipartite matching, and its training and inference are naturally NMS-free and box-free. Without bells and whistles, K-Net surpasses all previous published stateof- the-art single-model results of panoptic segmentation on MS COCO test-dev split and semantic segmentation on ADE20K val split with 55.2% PQ and 54.3% mIoU, respectively. Its instance segmentation performance is also on par with Cascade Mask R-CNN on MS COCO with 60%-90% faster inference speeds.",
        "path": "/files/K-Net Towards Unified Image Segmentation.pdf"
    },

    {
        "keyword": "Image segmentation",
        "filename": "PointFlow Flowing Semantics Through Points for Aerial Image Segmentation",
        "description": "Aerial Image Segmentation is a particular semantic seg- mentation problem and has several challenging character- istics that general semantic segmentation does not have. There are two critical issues: The one is an extremely foreground-background imbalanced distribution, and the other is multiple small objects along with the complex back- ground. Such problems make the recent dense affinity con- text modeling perform poorly even compared with base- lines due to over-introduced background context. To handle these problems, we propose a point-wise affinity propaga- tion module based on the Feature Pyramid Network (FPN) framework, named PointFlow. Rather than dense affin- ity learning, a sparse affinity map is generated upon se- lected points between the adjacent features, which reduces the noise introduced by the background while keeping ef- ficiency. In particular, we design a dual point matcher to select points from the salient area and object bound- aries, respectively. Experimental results on three differ- ent aerial segmentation datasets suggest that the proposed method is more effective and efficient than state-of-the-art general semantic segmentation methods. Especially, our methods achieve the best speed and accuracy trade-off on three aerial benchmarks. Further experiments on three general semantic segmentation datasets prove the general- ity of our method. Code and models are made available.",
        "path": "/files/PointFlow Flowing Semantics Through Points for Aerial Image Segmentation.pdf"
    },

    {
        "keyword": "Image segmentation",
        "filename": "TransUNet Transformers Make Strong Encoders for Medical Image Segmentation",
        "description": "Medical image segmentation is an essential prerequisite for developing healthcare systems, especially for disease diagnosis and treat- ment planning. On various medical image segmentation tasks, the u- shaped architecture, also known as U-Net, has become the de-facto stan- dard and achieved tremendous success. However, due to the intrinsic locality of convolution operations, U-Net generally demonstrates limi- tations in explicitly modeling long-range dependency. Transformers, designed for sequence-to-sequence prediction, have emerged as alternative architectures with innate global self-attention mechanisms, but can result in limited localization abilities due to insuficient low-level details. In this paper, we propose TransUNet, which merits both Transformers and U-Net, as a strong alternative for medical image segmentation. On one hand, the Transformer encodes tokenized image patches from a con- volution neural network (CNN) feature map as the input sequence for extracting global contexts. On the other hand, the decoder upsamples the encoded features which are then combined with the high-resolution CNN feature maps to enable precise localization. We argue that Transformers can serve as strong encoders for medical im- age segmentation tasks, with the combination of U-Net to enhance finer details by recovering localized spatial information. TransUNet achieves superior performances to various competing methods on different medical applications including multi-organ segmentation and cardiac segmentation.",
        "path": "/files/TransUNet Transformers Make Strong Encoders for Medical Image Segmentation.pdf"
    },

    {
        "keyword": "Image segmentation",
        "filename": "UTNet A Hybrid Transformer Architecture for Medical Image Segmentation",
        "description": "Transformer architecture has emerged to be successful in a number of natural language processing tasks. However, its applications to medical vision remain largely unexplored. In this study, we present UTNet, a simple yet powerful hybrid Transformer architecture that in- tegrates self-attention into a convolutional neural network for enhancing medical image segmentation. UTNet applies self-attention modules in both encoder and decoder for capturing long-range dependency at different scales with minimal overhead. To this end, we propose an efficient self-attention mechanism along with relative position encoding that reduces the complexity of self-attention operation significantly from O(n2) to approximate O(n). A new self-attention decoder is also proposed to recover fine-grained details from the skipped connections in the encoder. Our approach addresses the dilemma that Transformer requires huge amounts of data to learn vision inductive bias. Our hybrid layer de- sign allows the initialization of Transformer into convolutional networks without a need of pre-training. We have evaluated UTNet on the multi-label, multi-vendor cardiac magnetic resonance imaging cohort. UTNet demonstrates superior segmentation performance and robustness against the state-of-the-art approaches, holding the promise to generalize well on other medical image segmentations.",
        "path": "/files/UTNet A Hybrid Transformer Architecture for Medical Image Segmentation.pdf"
    },

    {
        "keyword": "Image segmentation",
        "filename": "Using Machine Learning for Web Page Classification in Search Engine Optimization",
        "description": "This paper presents a novel approach of using machine learning algorithms based on experts’ knowledge to classify web pages into three predefined classes according to the degree of content adjustment to the search engine optimization (SEO) recommendations. In this study, classifiers were built and trained to classify an unknown sample (web page) into one of the three predefined classes and to identify important factors that affect the degree of page adjustment. The data in the training set are manually labeled by domain experts. The experimental results show that machine learning can be used for predicting the degree of adjustment of web pages to the SEO recommendations—classifier accuracy ranges from 54.59% to 69.67%, which is higher than the baseline accuracy of classification of samples in the majority class (48.83%). Practical significance of the proposed approach is in providing the core for building software agents and expert systems to automatically detect web pages, or parts of web pages, that need improvement to comply with the SEO guidelines and, therefore, potentially gain higher rankings by search engines. Also, the results of this study contribute to the field of detecting optimal values of ranking factors that search engines use to rank web pages. Experiments in this paper suggest that important factors to be taken into consideration when preparing a web page are page title, meta description, H1 tag (heading), and body text—which is aligned with the findings of previous research. Another result of this research is a new data set of manually labeled web pages that can be used in further research.",
        "path": "/files/Using Machine Learning for Web Page Classification in Search Engine Optimization.pdf"
    },

    {
        "keyword": "Lane segmentation",
        "filename": "A Deep Learning-Based Benchmarking Framework for Lane Segmentation in the Complex and Dynamic Road Scenes",
        "description": "Automatic lane detection is a classical task in autonomous vehicles that traditional computer vision techniques can perform. However, such techniques lack reliability for achieving high accuracy while maintaining adequate time complexity in the context of real-time detection in complex and ynamic road scenes. Deep neural networks have proved their ability to achieve competing accuracy and time complexity while training them on manually labeled data. Yet, the unavailability of segmentation masks for host lanes in harsh road environments hinders fully supervised methods' operability on such a problem. This work proposes integrating traditional computer vision techniques and deep learning methods to develop a reliable benchmarking framework for lane detection tasks in complex and dynamic road scenes. Firstly, an automatic segmentation algorithm based on a sequence of traditional computer vision techniques has been experimented. This algorithm precisely segments the semantic region of the host lane in the complex urban images of nuScenes dataset used in this framework; hence corresponding weak labels are generated. After that, the developed data is qualitatively evaluated to be used in training and benchmarking ve state-of-the-art FCN-based architectures: SegNet, Modified SegNet, U-Net, ResUNet, and ResUNetCC. The performance evaluation of the trained models is done visually and quantitatively by considering lane detection a binary semantic segmentation task. The output results show robust performance, especially ResUNetCC, which outperforms all the other models while testing them in different complex road scenes with dynamic scenarios and various lighting conditions.",
        "path": "/files/A Deep Learning-Based Benchmarking Framework for Lane Segmentation in the Complex and Dynamic Road Scenes.pdf"
    },

    {
        "keyword": "Lane segmentation",
        "filename": "A Fast and Robust Lane Detection Method Based on Semantic Segmentation and Optical Flow Estimation",
        "description": "Lane detection is a significant technology for autonomous driving. In recent years, a number of lane detection methods have been proposed. However, the performance of fast and slim methods is not satisfactory in sophisticated scenarios and some robust methods are not fast enough. Consequently, we proposed a fast and robust lane detection method by combining a semantic segmentation network and an optical flow estimation network. Specifically, the whole research was divided into three parts: lane segmentation, lane discrimination, and mapping. In terms of lane segmentation, a robust semantic segmentation network was proposed to segment key frames and a fast and slim optical flow estimation network was used to track non-key frames. In the second part, density-based spatial clustering of applications with noise (DBSCAN) was adopted to discriminate lanes. Ultimately, we proposed a mapping method to map lane pixels from pixel coordinate system to camera coordinate system and fit lane curves in the camera coordinate system that are able to provide feedback for autonomous driving. Experimental results verified that the proposed method can speed up robust semantic segmentation network by three times at most and the accuracy fell 2% at most. In the best of circumstances, the result of the lane curve verified that the feedback error was 3%.",
        "path": "/files/A Fast and Robust Lane Detection Method Based on Semantic Segmentation and Optical Flow Estimation.pdf"
    },

    {
        "keyword": "Lane segmentation",
        "filename": "A novel multimodal fusion network based on a joint coding model for lane line segmentation",
        "description": "There has recently been growing interest in utilizing multimodal sensors to achieve robust lane line segmentation. In this paper, we introduce a novel multimodal fusion architecture from an information theory perspective, and demonstrate its practical utility using Light Detection and Ranging (LiDAR) camera fusion networks. In particular, we develop, for the first time, a multimodal fusion network as a joint coding model, where each single node, layer, and pipeline is represented as a channel. The forward propagation is thus equal to the information transmission in the channels. Then, we can qualitatively and quantitatively analyze the effect of different fusion approaches. We argue the optimal fusion architecture is related to the essential capacity and its allocation based on the source and channel. To test this multimodal fusion hypothesis, we progressively determine a series of multimodal models based on the proposed fusion methods and evaluate them on the KITTI and the A2D2 datasets. Our optimal fusion network achieves 85%+ lane line accuracy and 98.7%+ overall. The performance gap among the models will inform continuing future research into development of optimal fusion algorithms for the deep multimodal learning community.",
        "path": "/files/A novel multimodal fusion network based on a joint coding model for lane line segmentation.pdf"
    },

    {
        "keyword": "Lane segmentation",
        "filename": "A Review of Lane Detection Based on Semantic Segmentation",
        "description": "With the introduction of full convolutional neural product networks, semantic segmentation networks have also been widely used in the field of deep learning. Most lane detection tasks are currently done on the basis of semantic segmentation networks, so the development of semantic segmentation also directly determines the progress of lane detection. Methods: The development of semantic segmentation networks and the performance comparison between different model frames are used to summarize the improvement points as well as the advantages and disadvantages of each approach. Current lane detection network models with good performance based on semantic segmentation networks are described and the performance between the models is compared. Result: The current development of deep learning-based lane detection methods has been very fruitful, with significant improvements in network performance, but they cannot yet be applied in practice. For example, lightweight networks are not stable enough in extracting features, while deep neural networks are too ineffective in real time. Conclusion: Lane detection is of high research value as a key technology for unmanned driving. However, most of the current neural network methods have not been studied from a practical point of view, and there are few methods that use multiple frames as a basis for research. Therefore, in the future how to efficiently use continuous images for lane detection is a key direction to be researched in the future.",
        "path": "/files/A Review of Lane Detection Based on Semantic Segmentation.pdf"
    },

    {
        "keyword": "Lane segmentation",
        "filename": "Keep Your Eyes on the Lane Real Time Attention Guided Lane Detection",
        "description": "Modern lane detection methods have achieved remark- able performances in complex real-world scenarios, but many have issues maintaining real-time efficiency, which is important for autonomous vehicles. In this work, we pro- pose LaneATT: an anchor-based deep lane detection model, which, akin to other generic deep object detectors, uses the anchors for the feature pooling step. Since lanes follow a regular pattern and are highly correlated, we hypothesize that in some cases global information may be crucial to infer their positions, especially in conditions such as oc- clusion, missing lane markers, and others. Thus, this work proposes a novel anchor-based attention mechanism that aggregates global information. The model was evaluated ex- tensively on three of the most widely used datasets in the liter- ature. The results show that our method outperforms the cur- rent state-of-the-art methods showing both higher efficacy and efficiency. Moreover, an ablation study is performed along with a discussion on efficiency trade-off options that are useful in practice.",
        "path": "/files/Keep Your Eyes on the Lane Real Time Attention Guided Lane Detection.pdf"
    },

    {
        "keyword": "Lane segmentation",
        "filename": "Key Points Estimation and Point Instance Segmentation Approach for Lane Detection",
        "description": "Perception techniques for autonomous driving should be adaptive to various environments. In the case of traffic line detection, an essential perception module, many condition should be considered, such as number of traffic lines and computing power of the target system. To address these problems, in this paper, we propose a traffic line detection method called Point Instance Network (PINet); the method is based on the key points estimation and instance segmentation approach. The PINet includes several stacked hourglass networks that are trained simultaneously. Therefore the size of the trained models can be chosen according to the computing power of the target environment. We cast a clustering problem of the predicted key points as an instance segmentation problem; the PINet can be trained regardless of the number of the traffic lines. The PINet achieves competitive accuracy and false positive on the TuSimple and Culane datasets, popular public datasets for lane detection.",
        "path": "/files/Key Points Estimation and Point Instance Segmentation Approach for Lane Detection.pdf"
    },

    {
        "keyword": "Search Engine Optimization",
        "filename": "A representative online survey among German search engine users with a focus on questions regarding search engine optimization SEO a study within the SEO Effect project",
        "description": "This working paper describes the representative online survey within the research project SEO-Effekt. To incorporate the perspective of search engine users, we conducted a representative online survey with N=2,012 German internet users. The survey focused on search engine optimization (SEO), but also included questions about paid search marketing (PSM), usage behavior, self-assessment, trust in search engines, and personalization. We found that SEO is much less known to internet users than PSM and that the level of knowledge and the opinions about SEO are correlated with the user’s education and their affinity to SEO topics. Furthermore, users expressed a high self-assessment of their search engine literacy, a slightly positive view on the trustworthiness of search engines and a rather negative attitude towards personalization. Future research is promising in (1) an annual repetition of the online survey and (2) in a realization of the survey in other (European) countries.",
        "path": "/files/A representative online survey among German search engine users with a focus on questions regarding search engine optimization SEO a study within the SEO Effect project.pdf"
    },

    {
        "keyword": "Search Engine Optimization",
        "filename": "Content Management Systems Performance and Compliance Assessment Based on a Data Driven Search Engine Optimization Methodology",
        "description": "While digitalization of cultural organizations is in full swing and growth, it is common knowledge that websites can be used as a beacon to expand the awareness and consideration of their services on the Web. Nevertheless, recent research results indicate the managerial difficulties in deploying strategies for expanding the discoverability, visibility, and accessibility of these websites. In this paper, a three-stage data-driven Search Engine Optimization schema is proposed to assess the performance of Libraries, Archives, and Museums websites (LAMs), thus helping administrators expand their discoverability, visibility, and accessibility within the Web realm. To do so, the authors examine the performance of 341 related websites from all over the world based on three different factors, Content Curation, Speed, and Security. In the first stage, a statistically reliable and consistent assessment schema for evaluating the SEO performance of LAMs websites through the integration of more than 30 variables is presented. Subsequently, the second stage involves a descriptive data summarization for initial performance estimations of the examined websites in each factor is taking place. In the third stage, predictive regression models are developed to understand and compare the SEO performance of three different Content Management Systems, namely the Drupal,WordPress, and custom approaches, that LAMs websites have adopted. The results of this study constitute a solid stepping-stone both for practitioners and researchers to adopt and improve such methods that focus on end-users and boost organizational structures and culture that relied on data-driven approaches for expanding the visibility of LAMs services.",
        "path": "/files/Content Management Systems Performance and Compliance Assessment Based on a Data Driven Search Engine Optimization Methodology.pdf"
    },

    {
        "keyword": "Search Engine Optimization",
        "filename": "Development and software implementation of a preliminary model to identify the probability of search engine optimization on webpages",
        "description": "This working paper describes the development and implementation of the software to determine the probability of search engine optimization of a web page. The software tool is written in Python with various programming libraries to scrape data from the web, analyze source codes of URLs, analyze defined indicators, perform retrieval and text matching tasks, and write and read data from a PostgreSQL database. We use a model-view-controller pattern to ensure the flexibility of the software in terms of extending its capabilities and replacing modules. Probability analysis is performed by a rule-based classifier built on our model of potential SEO indicators defined by the state of research in the project (expert interviews, literature reviews, and experiments with multiple test cases). The current state of the software allows us to determine whether SEO actions have been taken for a given URL. We collect URLs either by scraping commercial search engines or by uploading lists of web pages. For each URL, we analyze the HTML code, from which we extract information using SEO and analysis tools. We also extract SEO indicators at the page and site level (e.g., page descriptions and page speed). We complement this approach by using lists of manually classified websites. An analysis based on three datasets with a total of 2,043 search queries and 263,790 results shows that a large proportion of the pages found in Google are at least probably optimized, which is in line with statements by SEO experts that it is very difficult to gain visibility in search engines without applying SEO techniques.",
        "path": "/files/Development and software implementation of a preliminary model to identify the probability of search engine optimization on webpages.pdf"
    },

    {
        "keyword": "Search Engine Optimization",
        "filename": "The influence of search engine optimization on Google’s results",
        "description": "Search engine optimization (SEO) can significantly influence what is shown on the result pages of commercial search engines. However, it is unclear what proportion of (top) results have actually been optimized.We developed a tool that uses a semi-automatic approach to detect, based on a given URL, whether SEO measures were taken. In this multi-dimensional approach, we analyze the HTML code from which we extract information on SEO and analytics tools. Further, we extract SEO indicators on the page level and the website level (e.g., page descriptions and loading time of a website). We amend this approach by using lists of manually classified websites and use machine learning methods to improve the classifier. An analysis based on three datasets with a total of 1,914 queries and 256,853 results shows that a large fraction of pages found in Google is at least probably optimized, which is in line with statements from SEO experts saying that it is tough to gain visibility in search engines without applying SEO techniques.",
        "path": "/files/The influence of search engine optimization on Google’s results.pdf"
    },

    {
        "keyword": "Search Engine Optimization",
        "filename": "Using Machine Learning for Web Page Classification in Search Engine Optimization",
        "description": "This paper presents a novel approach of using machine learning algorithms based on experts’ knowledge to classify web pages into three predefined classes according to the degree of content adjustment to the search engine optimization (SEO) recommendations. In this study, classifiers were built and trained to classify an unknown sample (web page) into one of the three predefined classes and to identify important factors that affect the degree of page adjustment. The data in the training set are manually labeled by domain experts. The experimental results show that machine learning can be used for predicting the degree of adjustment of web pages to the SEO recommendations—classifier accuracy ranges from 54.59% to 69.67%, which is higher than the baseline accuracy of classification of samples in the majority class (48.83%). Practical significance of the proposed approach is in providing the core for building software agents and expert systems to automatically detect web pages, or parts of web pages, that need improvement to comply with the SEO guidelines and, therefore, potentially gain higher rankings by search engines. Also, the results of this study contribute to the field of detecting optimal values of ranking factors that search engines use to rank web pages. Experiments in this paper suggest that important factors to be taken into consideration when preparing a web page are page title, meta description, H1 tag (heading), and body text—which is aligned with the findings of previous research. Another result of this research is a new data set of manually labeled web pages that can be used in further research.",
        "path": "/files/Using Machine Learning for Web Page Classification in Search Engine Optimization.pdf"
    },

    {
        "keyword": "Search Engine Optimization",
        "filename": "Web search basics and SEO",
        "description": "Slides that explain basics of search engine and SEO.",
        "path": "/files/Web search basics and SEO.pptx"
    },

    {
        "keyword": "Bitcoin Mining",
        "filename": "An Equilibrium Model of the Market for Bitcoin Mining",
        "description": "We propose a model which uses the Bitcoin/US dollar exchange rate to predict the computing power of the Bitcoin network. We show that free entry places an upper-bound on mining revenues and we devise a structural framework to measure its value. Calibrating the model’s parameters allows us to accurately forecast the evolution of the network computing power over time. We establish the accuracy of the model through out-of-sample tests and investigation of the entry rule.",
        "path": "/files/An Equilibrium Model of the Market for Bitcoin Mining.pdf"
    },

    {
        "keyword": "Bitcoin Mining",
        "filename": "Conditions for Advantageous Quantum Bitcoin Mining",
        "description": "Our aim is to determine conditions for quantum computing technology to give rise to security risks associated with quantum Bitcoin mining. Specifically, we determine the speed and energy efficiency a quantum computer needs to offer an advantage over classical mining. We analyze the setting in which the Bitcoin network is entirely classical except for a single quantum miner who has small hash rate compared to that of the network. We develop a closed-form approximation for the probability that the quantum miner successfully mines a block, with this probability dependent on the number of Grover iterations the quantum miner applies before making a measurement. Next, we show that, for a quantum miner that is peaceful, this success probability is maximized if the quantum miner applies Grover iterations for 16 minutes before measuring, which is surprising as the network mines blocks every 10 minutes on average. Using this optimal mining procedure, we show that the quantum miner outperforms a classical computer in effciency (cost per block) if the condition Q < Crb is satisfied, where Q is the cost of a Grover iteration, C is the cost of a classical hash, r is the quantum miner's speed in Grover iterations per second, and b is a factor that attains its maximum if the quantum miner uses our optimal mining procedure. This condition lays the foundation for determining when quantum mining, and the known security risks associated with it, will arise.",
        "path": "/files/Conditions for Advantageous Quantum Bitcoin Mining.pdf"
    },

    {
        "keyword": "Bitcoin Mining",
        "filename": "Incentive Mechanism for Rational Miners in Bitcoin Mining Pool",
        "description": "Bitcoin is the most popular cryptocurrency in the world. Miners in the Bitcoin network reduce their risks through participating in mining pool. Existing mining pool systems do not consider the cost and strategy of miners. In this paper, we study two mining models: public cost model and private cost model. For the public cost model, we design an incentive mechanism, called Mining game, using a Stackelberg game. We show that Mining game is individually rational, profitable, and has the unique Stackelberg Equilibrium. For the private cost model, we formulate the Budget Feasible Reward Optimization (BFRO) problem to maximize the reward function under the budget constraint, and design a budget feasible reverse auction to solve the BFRO problem, which is computationally efficient, individually rational, truthful, budget feasible, and constant approximate. Through extensive simulations, we evaluate the performance and validate the theoretical properties of our incentive mechanisms.",
        "path": "/files/Incentive Mechanism for Rational Miners in Bitcoin Mining Pool.pdf"
    },

    {
        "keyword": "Bitcoin Mining",
        "filename": "MiningVis Visual Analytics of the Bitcoin Mining",
        "description": "We present a visual analytics tool, MiningVis, to explore the long-term historical evolution and dynamics of the Bitcoin mining ecosystem. Bitcoin is a cryptocurrency that attracts much attention but remains difficult to understand. Particularly important to the success, stability, and security of Bitcoin is a component of the system called “mining.” Miners are responsible for validating transactions and are incentivized to participate by the promise of a monetary reward. Mining pools have emerged as collectives of miners that ensure a more stable and predictable income. MiningVis aims to help analysts understand the evolution and dynamics of the Bitcoin mining ecosystem, including mining market statistics, multi-measure mining pool rankings, and pool hopping behavior. Each of these features can be compared to external data concerning pool characteristics and Bitcoin news. In order to assess the value of MiningVis, we conducted online interviews and insight-based user studies with Bitcoin miners. We describe research questions tackled and insights made by our participants and illustrate practical implications for visual analytics systems for Bitcoin mining.",
        "path": "/files/MiningVis Visual Analytics of the Bitcoin Mining.pdf"
    },

    {
        "keyword": "Bitcoin Mining",
        "filename": "On Game-theoretic Computation Power Diversification in the Bitcoin Mining Network",
        "description": "In the Bitcoin mining network, miners contribute computation power to solve crypto-puzzles in exchange for financial rewards. Due to the randomness and the competitiveness of mining, individual miners tend to join mining pools for low risks and steady incomes. Usually, a pool is managed by its central operator, who charges fees for providing risk-sharing services. This paper presents a hierarchical distributed computation paradigm where miners can distribute their power among multiple pools. By adding virtual pools, we separate miners’ dual roles of being the operator as well as being the member when solo mining. We formulate a multi-leader multi-follower Stackelberg game to study the joint utility maximization of pool operators and miners, thereby addressing a computation power allocation problem. We investigate two practical pool operation modes, a uniform-sharedifficulty mode and a nonuniform-share-difficulty mode.We derive analytical results for the Stackelberg equilibrium of the game under both modes, based on which optimal strategies are designed for all operators and miners. Numerical evaluations are presented to verify the proposed model.",
        "path": "/files/On Game-theoretic Computation Power Diversification in the Bitcoin Mining Network.pdf"
    },

    {
        "keyword": "Bitcoin Mining",
        "filename": "Visual analytics of bitcoin mining pool evolution on the road toward stability",
        "description": "We present our work on visual analytics tools to support the analysis of Bitcoin mining pool evolution. Mining blocks are a critical component of the Bitcoin ecosystem, helping to keep the system secure, valid, and stable. At the same time, mining is a resource-intensive activity that continues to get more and more difficult. Mining pools have emerged to address this issue and to ensure a more stable and predictable income by sharing computing power. Yet, increased centralization of the mining power is also not without dangers (e. g., the 51% attack), and, thus, it is important to better understand and analyze mining pool activities in Bitcoin. Here, we report three contributions: our extensive data collection on Bitcoin mining pools, our development of two custom visualizations, and our first exploratory data analysis leading to hypotheses and documented activities about pools’ main features such as market share, reward rules, or location.",
        "path": "/files/Visual analytics of bitcoin mining pool evolution on the road toward stability.pdf"
    },

    {
        "keyword": "Quantum computing",
        "filename": "Medical image classification via quantum neural networks",
        "description": "Machine Learning provides powerful tools for a variety of applications, including disease diagnosis through medical image classification. In recent years, quantum machine learning techniques have been put forward as a way to potentially enhance performance in machine learning applications, both through quantum algorithms for linear algebra and quantum neural networks. In this work, we study two different quantum neural network techniques for medical image classification: first by employing quantum circuits in training of classical neural networks, and second, by designing and training quantum orthogonal neural networks. We benchmark our techniques on two different imaging modalities, retinal color fundus images and chest X-rays. The results show the promises of such techniques and the limitations of current quantum hardware.",
        "path": "/files/Medical image classification via quantum neural networks.pdf"
    },

    {
        "keyword": "Quantum computing",
        "filename": "Quantum Computing at the Frontiers of Biological Sciences",
        "description": "The search for meaningful structure in biological data has relied on cutting-edge advances in computational technology and data science methods. However, challenges arise as we push the limits of scale and complexity in biological problems. Innovation in massively parallel, classical computing hardware and algorithms continues to address many of these challenges, but there is a need to simultaneously consider new paradigms to circumvent current barriers to processing speed. Accordingly, we articulate a view towards quantum computation and quantum information science, where algorithms have demonstrated potential polynomial and exponential computational speedups in certain applications, such as machine learning. The maturation of the field of quantum computing, in hardware and algorithm development, also coincides with the growth of several collaborative efforts to address questions across length and time scales, and scientific disciplines. We use this coincidence to explore the potential for quantum computing to aid in one such endeavor: the merging of insights from genetics, genomics, neuroimaging and behavioral phenotyping. By examining joint opportunities for computational innovation across fields, we highlight the need for a common language between biological data analysis and quantum computing. Ultimately, we consider current and future prospects for the employment of quantum computing algorithms in the biological sciences.",
        "path": "/files/Quantum Computing at the Frontiers of Biological Sciences.pdf"
    },

    {
        "keyword": "Quantum computing",
        "filename": "Quantum computing enhanced computational catalysis",
        "description": "The quantum computation of electronic energies can break the curse of dimensionality that plagues manyparticle quantum mechanics. It is for this reason that a universal quantum computer has the potential to fundamentally change computational chemistry and materials science, areas in which strong electron correlations present severe hurdles for traditional electronic structure methods. Here we present a state-of-the-art analysis of accurate energy measurements on a quantum computer for computational catalysis, using improved quantum algorithms with more than an order of magnitude improvement over the best previous algorithms. As a prototypical example of local catalytic chemical reactivity we consider the case of a ruthenium catalyst that can bind, activate, and transform carbon dioxide to the high-value chemical methanol. We aim at accurate resource estimates for the quantum computing steps required for assessing the electronic energy of key intermediates and transition states of its catalytic cycle. In particular, we present quantum algorithms for double-factorized representations of the four-index integrals that can significantly reduce the computational cost over previous algorithms, and we discuss the challenges of increasing active space sizes to accurately deal with dynamical correlations. We address the requirements for future quantum hardware in order to make a universal quantum computer a successful and reliable tool for quantum computing enhanced computational materials science and chemistry, and identify open questions for further research.",
        "path": "/files/Quantum computing enhanced computational catalysis.pdf"
    },

    {
        "keyword": "Quantum computing",
        "filename": "Quantum computing models for artificial neural networks",
        "description": "Neural networks are computing models that have been leading progress in Machine Learning (ML) and Artificial Intelligence (AI) applications. In parallel, the first small scale quantum computing devices have become available in recent years, paving the way for the development of a new paradigm in information processing. Here we give an overview of the most recent proposals aimed at bring- ing together these ongoing revolutions, and particularly at implementing the key functionalities of artidicial neural networks on quantum architectures. We highlight the exciting perspectives in this context, and discuss the potential role of near term quantum hardware in the quest for quantum machine learning advantage.",
        "path": "/files/Quantum computing models for artificial neural networks.pdf"
    },

    {
        "keyword": "Quantum computing",
        "filename": "Rodeo Algorithm for Quantum Computing",
        "description": "We present a stochastic quantum computing algorithm that can prepare any eigenvector of a quantum Hamiltonian within a selected energy interval EQN. In order to reduce the spectral weight of all other eigenvectors by a suppression factor EQN, the required computational effort scales as EQN, where p is the squared overlap of the initial state with the target eigenvector. The method, which we call the rodeo algorithm, uses auxiliary qubits to control the time evolution of the Hamiltonian minus some tunable parameter E. With each auxiliary qubit measurement, the amplitudes of the eigenvectors are multiplied by a stochastic factor that depends on the proximity of their energy to E. In this manner, we converge to the target eigenvector with exponential accuracy in the number of measurements. In addition to preparing eigenvectors, the method can also compute the full spectrum of the Hamiltonian. We illustrate the performance with several examples. For energy eigenvalue determination with error EQN, the computational scaling is EQN. For eigenstate preparation, the computational scaling is EQN, where EQN is the magnitude of the orthogonal component of the residual vector. The speed for eigenstate preparation is exponentially faster than that for phase estimation or adiabatic evolution.",
        "path": "/files/Rodeo Algorithm for Quantum Computing.pdf"
    },

    {
        "keyword": "Quantum computing",
        "filename": "The prospects of quantum computing in computational molecular biology",
        "description": "Quantum computers can in principle solve certain problems exponentially more quickly than their classical counterparts. We have not yet reached the advent of useful quantum computation, but when we do, it will affect nearly all scientific disciplines. In this review, we examine how current quantum algorithms could revolutionize computational biology and bioinformatics. There are potential benefits across the entire field, from the ability to process vast amounts of information and run machine learning algorithms far more efficiently, to algorithms for quantum simulation that are poised to improve computational calculations in drug discovery, to quantum algorithms for optimization that may advance fields from protein structure prediction to network analysis. However, these exciting prospects are susceptible to “hype,” and it is also important to recognize the caveats and challenges in this new technology. Our aim is to introduce the promise and limitations of emerging quantum computing technologies in the areas of computational molecular biology and bioinformatics.",
        "path": "/files/The prospects of quantum computing in computational molecular biology.pdf"
    }]
}